Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

OpenTofu will perform the following actions:

  # module.cloudflare-dns.cloudflare_dns_record.dns_record will be updated in-place
~ resource "cloudflare_dns_record" "dns_record" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-05-23T19:10:42Z" -> (known after apply)
        id                  = "228371bde09ff7188598f4df8a3b835c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-05-25T12:59:03Z" -> (known after apply)
      ~ name                = "postgres.opentoucan.com" -> "postgres"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.s3["postgres-backup"].minio_s3_bucket.bucket will be created
+ resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "postgres-backup"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

  # module.s3["prod-discord-409696112144810014"].minio_s3_bucket.bucket will be created
+ resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "prod-discord-409696112144810014"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```